Hi @mattburgess, thanks for looking into this.

Yes, apologies I've been slightly stingy with my plan output as didn't want to share anything I shouldn't.
You've recreated my issue exactly.

With my existing configuration, I'm also seeing the certificate transparency logging option as the reason for replacement - I should have spotted this earlier apologies.

Section from the plan on `aws_acm_certificate.cert` resource shown below.
```
  # module.vault_cert.aws_acm_certificate.cert must be replaced
-/+ resource "aws_acm_certificate" "cert" {
      ~ arn                       = "arn:aws:acm:eu-west-2:<account-number>:certificate/<guid>" -> (known after apply)
      - certificate_authority_arn = "" -> null
      ~ certificate_body          = <<-EOT

    .............

      ~ type                      = "IMPORTED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
      ~ validation_method         = "NONE" -> (known after apply)
        # (1 unchanged attribute hidden)

      - options {
          - certificate_transparency_logging_preference = "DISABLED" -> null # forces replacement
        }
    }
```

Adding the options as you did in `cert.tf` looks like it fixed my issue.
The plan will now update in place.
```
  # module.vault_cert.aws_acm_certificate.cert will be updated in-place
  ~ resource "aws_acm_certificate" "cert" {
      ~ certificate_body          = <<-EOT
```

For imported certificates, should the provider be setting the `certificate_transparency_logging_preference` to DISABLED by default?

Thanks again for your help.
